# WarpingConstant Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSection..::..WarpingConstant Property
StructuralSection Class See Also
---
Warping constant (Cw, Iomega, H).
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double WarpingConstant { get; set; }
```

Visual Basic
---
```text
Public Property WarpingConstant As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double WarpingConstant {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace